{"last_cache":"2024-08-29T12:05:43.525Z","Dragalia":{},"KoL":{"August 14":"https://www.kingdomofloathing.com/","August 12":"https://www.kingdomofloathing.com/","August 09":"https://www.kingdomofloathing.com/","July 31":"https://www.kingdomofloathing.com/","March 06":"https://www.kingdomofloathing.com/"},"Lost Ark":{"Steam Summer Sale":"https://www.playlostark.com/en-us/news/articles/2024-steam-summer-sale?tag=events","Thaemine The First Details":"https://www.playlostark.com/en-us/news/articles/thaemine-the-first-details?tag=events","2024 New Year Celebration":"https://www.playlostark.com/en-us/news/articles/new-year-celebration-2024?tag=events","Lost Ark Anniversary Art Contest":"https://www.playlostark.com/en-us/news/articles/2nd-anniversary-art-contest?tag=events","Maykoko Fest Emote Design Competition":"https://www.playlostark.com/en-us/news/articles/maykoko-emote-design-competition?tag=events","Announcing Maykoko Fest":"https://www.playlostark.com/en-us/news/articles/maykoko-fest-explainer?tag=events","Pixel Glasses & Growth Twitch Drop":"https://www.playlostark.com/en-us/news/articles/twitch-drop-march-2023?tag=events","New Prime Gaming Loot - Magick Society Special Dye Chest":"https://www.playlostark.com/en-us/news/articles/prime-gaming-loot-march-2023?tag=events","Anniversary Celebration":"https://www.playlostark.com/en-us/news/articles/first-anniversary-celebration?tag=events"},"Mabinogi":{"Connous Beach Vacation Event (2024)":"https://wiki.mabinogiworld.com//view/Connous_Beach_Vacation_Event_(2024)","Master Plan Sizzling Summer Boot Camp":"https://wiki.mabinogiworld.com//view/Master_Plan_Sizzling_Summer_Boot_Camp","Glenn Bearna Support":"https://wiki.mabinogiworld.com//view/Glenn_Bearna_Dungeon_Support"},"Maplestory":{},"OSRS":{"Araxxor":"https://secure.runescape.com/m=news/araxxor?oldschool=1","New Prices 2024":"https://secure.runescape.com/m=news/new-prices-2024?oldschool=1","Deadman: Armageddon Winners & Further Action":"https://secure.runescape.com/m=news/deadman-armageddon-winners--further-action?oldschool=1","Community Showcase - August 2024":"https://secure.runescape.com/m=news/community-showcase---august-2024?oldschool=1","Behind the Scenes of Sailing: Volume 1":"https://secure.runescape.com/m=news/behind-the-scenes-of-sailing-volume-1?oldschool=1"},"Path of Exile":{},"Tarkov":{},"Vindictus":{"Sanyaa: The Lost Outsider":"lo, this is the Vindictus team.\n\nToday we're introducing the [b]25th[/b] hero of Vindictus, [b]Sanyaa.[/b]\n\n \n\nShe is a female character who wields [b]Dual Knives[/b].\n\n \n\nThese are fast and precise weapons that target the weaknesses of her enemies and are a perfect match for her hand-to-hand skills. \n\nUtilizing combat resources that build up over the course of the fight, players will be able to experience dynamic gameplay.\n\nAs you dodge enemy attacks and successfully counterattack, certain moves become more powerful, and can turn the tide of battle in your favor.\n\nShe's a fun character to play, with quick attacks and deft dodges! \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1367/sanyaa1.jpg[/img]\n\n[b](Sanyaa with Dual Knives)[/b]\n\n \n[list][*][b]Quickly dodge enemy attacks[/b][/*][/list]\nSanyaa is a character who specializes in dodging incoming attacks.\n\nYou have two basic dodges and can use [b]Egret Step[/b] to quickly dodge in emergencies.\n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1368/sanyaa2.jpg[/img]\n\n[b](Sanyaa dodging enemy attacks)[/b]\n\n \n[list][*][b]Dodge and counterattack[/b][/*][/list]\nSanyaa can rapidly counter with a [b]Shadow Reprisal[/b] if she times her dodge.\n\nIf you successfully counter with [b]Shadow Reprisal[/b], you'll be in a [b]Playful[/b] state for a period of time.\n\n[img]https://nxcache.nexon.net/cms/2024/q3/1369/sanyaa3.jpg[/img]\n\n[b](Counterattacking Sanyaa)[/b]\n\n \n[list][*][b]Playful[/b][/*][/list]\nWhen Sanyaa is being Playful, her [b]Heron Step[/b] skill is enhanced to [b]Shadow Play[/b] to dance around her adversaries.  \n\nIn addition, her [b]Swift Slash[/b] skill is enhanced to [b]Play Rough[/b], which can turn the tide of battle in your favor. \n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1370/sanyaa4.jpg[/img]\n\n[b](Sanyaa attacking with Play Rough)[/b]\n\n \n[list][*][b]Sanyaa's quick approach and powerful skills[/b][/*][/list]\nSanyaa's [b]Active: Thief's Mark[/b] allows her to mark her enemies.\n\nAfter marking them, re-entering an active skill during its duration will allow Sanyaa to quickly approach and attack the marked target.\n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1371/sanyaa5.jpg[/img]\n\n[b](Sanyaa approaching the marked target)[/b]\n\n \n\n\"[b]Active: Take Flight[/b]\" is a skill that attacks enemies by spinning in midair.\n\nFrom the moment you spin, you can change direction with the directional keys.\n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1372/sanyaa6.jpg[/img]\n\n \n\nOther moves include \"[b]Active: Vanishing Dance[/b],\" which lets you disappear for a moment and then attack, \"[b]Active: Crescent Kick[/b","[INTRO] Sanyaa":"ABOUT][/b]\n\nThe Lost Outsider of Dusk and Dawn\n\nSanyaa was sent away from home at a young age, growing up in a mysterious thieves' guild. \n\nAn altruistic noble by day; a mysterious thief by night. \n\nShe enjoyed her double life... until it all came crashing down.\n\nStalking that vicious culprit leads her to Colhen. \n\n \n\nSanyaa's Dual Knives allow for swift and exact targeting of enemy weak points, \n\nand they harmonize well with her close combat skills. \n\nShe gains battle resources as she attacks, allowing for a thrilling experience. \n\nIf she successfully dodges an enemy's attack and counters, \n\ncertain moves become more powerful, turning the battle to her favor. \n\nShe's an appealing character with enthralling gameplay, using fast attacks and nimble dodges. \n\n \n\n[b][SCREENSHOTS][/b]\n\n[b][img]https://nxcache.nexon.net/cms/2024/q3/1375/character_25_01.jpg[/img][/b]\n\n[b][img]https://nxcache.nexon.net/cms/2024/q3/1376/character_25_02.jpg[/img][/b]\n\n[b][img]https://nxcache.nexon.net/cms/2024/q3/1377/character_25_03.jpg[/img][/b]\n\n[b][img]https://nxcache.nexon.net/cms/2024/q3/1378/character_25_04.jpg[/img][/b]\n\n \n\n[b][GAMEPLAY TRAILER][/b]\n[previewyoutube=QyCZGTeBZdU;full][/previewyoutube]\n\n\n[b][EXCLUSIVE SKILLS][/b]\n\n[b]Active: Thief's Mark[/b]\n[previewyoutube=0Ee2bswIlaE;full][/previewyoutube]\n\nA skill that first marks a victim to attack later.\n\nSanyaa can track these opponents until they perish.\n\n \n\n[b]Active: Vanishing Dance[/b]\n[previewyoutube=J_48efEnLys;full][/previewyoutube]\n\nA skill where Sanyaa vanishes before striking.\n\nShe is always dodging while vanished.\n\n \n\n[b]Active: Shadow Dance[/b]\n[previewyoutube=ruwtDAKUJck;full][/previewyoutube]\n\nSanyaa's suppression skill mercilessly mutilates her enemy.\n\n \n\n[b]Active: Egret Step[/b]\n[previewyoutube=LsB9uC0NknI;full][/previewyoutube","[STORY] Sanyaa":"Story of SANYAA: The Lost Outsider\n\n \n\nAn attendant placed a letter on the desk. It bore an intricate crest stamped into a red wax seal. \n\n \n\nThe hands inspecting the parchment trembled, the many jeweled rings on those fingers clattering against each other. The eyes reading it went wide with shock, then watery with fear. \n\n​\n\n\"The Shadow Society...\" The reader's whole body began to shake. It had finally happened.\n\n \n\nIf you were rich but not respectful, if you had more coin than scruples, then it was said the Shadow Society would come and settle accounts. They were said to always announce their heists ahead of time with a calling card. He knew they weren't just some urban legend, but he also never thought he'd be in their crosshairs. It was only a matter of time, now... He needed to prepare for what was coming.  \n\n​\n\n-\n\n​\n\nThe land of Galoa, located at the eastern end of the vast western continent. Though located far from the frontlines, the long war against the Fomors is felt even here. Passing armies took the people's harvest in the name of supplies, and now the residents faced famine. Despite these difficult times, the residents of one town managed to persevere.\n\n​\n\n\"Back of the line, Marf. I saw you cut in.\"\n\n​\n\nBehind a wooden table stacked with baskets of bread loaves, a young woman stood adamant, her voice firm and clear. Her name was Sanyaa, though many knew her better by her appearance. It was not hard to see why. White hair, sparkling like snow in the sunlight, had the telltale signs of Westerner heritage. Yet her delicate facial features were those of an Easterner, and her skin was pale enough as to rival her soft locks. \n\n \n\nThe man called Marf looked sheepish, scratching his arm awkwardly, unsure of what to do with his hands.\n\n​\n\n\"Oh, have a heart, Sanyaa. I didn't even know there was a line.\" He apologized and shuffled to the back. A few people glanced over at him in pity. Sanyaa's sharp tongue had cut down many a villager, and her glare was enough to send a shiver down one's spine. They knew she had a good heart, though, as evidenced by her constant drive to make sure the townspeople had enough to eat despite the famine. \n\n​\n\n\"Here you go, Granny Rose.\" Sanyaa handed a piece of bread to the old matron at the front of the line. \n\n \n\nRose's wrinkled face had marked the passage of each year with harsh lines. When the woman handed her some bread, though, a smile bloomed on her face like a flower on a fresh spring day. \n\n​\n\n\"The Ellyllon family is truly a blessing to this town. Thank you so much, Mister Hejmdal.\"\n\n​\n\nThe man helping Sanyaa smiled warmly at the compliment. Reaching middle-age had greyed his hair, but his muscle had not diminished; he was powerfully built, but moved around the table and breadbaskets with startling agility. In fact, both he and Sanyaa seemed to have almost preternatural dexterity, shuffling around each other with equal parts care and speed. The father and daughter duo made quite the pair. The Ellyllon family was famed for helping to support people through difficult times, donating their money, their time, their muscle, and their compassion.\n\n​\n\n\"Hear, hear! She's right. It's only because of your help that we've been able to weather this famine. Three cheers for the Ellyllons!\"\n\n​\n\nThe villagers in line applauded loudly. Newfound relief washed over them as they realized how lucky they were. That this well-off family would help, when it wasn't their duty to, really was incredible. The laughter of the villagers felt as warm as the gentle sunlight.\n\n​\n\n\"Hey, have you heard the news?\"\n\n \n\n\"Uh oh,\" the man behind her groaned. They were still surrounded by enough hard times that it was enough to dampen one's spirits. \"What is it [u]now?[/u]\"\n\n​\n\nThe woman raised her eyebrows with some alarm.\n\n​\n\n\"I heard that... Baron Georg received a calling card.\"\n\n​\n\nHer words instantly captured the attention of everyone around her. Baron Georg resided one town over. He was very well-known for being very wealthy. \n\n​\n\n\"Oh, don't tell me...\"\n\n \n\n\"That's right. The Shadow Society has struck again. The baron hosted a fancy party recently. Flaunting all his wealth must have attracted their attention.\"\n\n \n\n\"I won't lie, lass... I'm torn. The last thing we need are thieves added to our troubles. On the other hand, that sure brings a smile to my face! It sounds like that lot only go after the rich.\"\n\n​\n\n\"The rich [u]and[/u] uncharitable. The ones that don't share, and then gloat about it.\" The villagers in line starting sharing their opinions in hushed but excited voices. The rustle of their conversations were like leaves carried on the breeze. They swirled and settled around Sanyaa. She simply looked on in silence... but she was not the only one to do so.\n\n​\n\nCount Galoa, who was watching the scene while hidden behind a tree, turned and strode away with far less than his usual fanfare or entourage. \n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1379/img_story_sanyaa_01.jpg[/img]\n\n \n\n \n\nLater that night, the town square was almost unrecognizable. While still as pleasant as ever, the hustle and bustle of the townsfolk was replaced by the stillness of the late hours and the quiet murmur of insects. Only the night breeze was present, now, and it settled gently like a blanket over the stalls. \n\nThis silence extended along the path leading up to Ellyllon Manor, nestled at the top of a low hill.\n\n \n\nThe moonlight shone through the glass of a large window. It gave the head of white hair an almost mystical quality, dancing playfully with the shadows of the room. After starting out the window for a good long while, a smile crawling slowly up her face, Sanyaa removed her rose-colored dress and folded it neatly. Her pale white skin seemed to absorb the moonlight, lending her an otherworldly mystique. Her lithe form moved with both grace and confidence. \n\n \n\nShe reached out a delicate hand and pressed the secret switch in her wardrobe. It felt smooth after all these years of use, and the back swung open silently to reveal a secret room. Within were the tools of her trade. The garb of a master thief allowed for ample movement, while the accompanying pockets and straps allowed for several light but useful pieces of gear.\n\n \n\nThe black garments covered white skin as storm clouds cover the moon. Sanyaa tightened the ties. It would do no good if the came loose during her heist, and she was nothing if not precise.\n\n \n\nShe did allow herself one indulgence, though, as she reached into the secret compartment to retrieve a final item. It was an elaborate, expensive custom sheath for a dagger, its detailing and craftsmanship clearly from the east. For others, it was a rare hint as to her actual heritage. For Sanyaa, though, it was the only memento she had of her childhood.\n\n \n\nIt was the last gift her father ever gave her; he had kept the dagger himself. She looked down at the sheath, glinting in the moonlight, with equal parts admiration and disdain. She'd always thought the sheath was beautiful, but her father had abandoned her, exiled her to these lands when she was but a child. There was no love lost there.\n\n \n\nPerhaps that's why she kept it around as a good luck charm. Perhaps it was a reminder that she could survive any hardship. She tried not to dwell on the fact that the sheath was inherently hollow.\n\n \n\nThe large window swung open silently on well-oiled hinges, cold night air filling bedroom. \n\n \n\nShe danced with her shadow across the lawn, over the hill and onto the road out of town, flitting between building and boulder. The moonlight could only capture glimpses of her movement, an ethereal experience that left questions as to her true location.\n\n​\n\nLater that night, in a neighboring town, Sanyaa approached Georg Manor. \n\n \n\nThe interior was said to be filled with classic furniture, exquisite decorations, and no little display of wealth. Though she was stealthy, Sanyaa ambled around the luxurious rooms as if she owned the place. She sampled delicacies and snidely mocked the ostentatious artwork hung across wallpapered walls. She may have been wandering while breaking and entering, but there was never hesitation in her steps.​\n\n \n\nShe'd know what she was looking for when she found it... and there it was. An elegant statue of a goddess, holding a sword. Sanyaa had developed an eye for value, and she knew that carving was surely the most expensive treasure the baron owned... the lavish way it was displayed was proof enough of that. Sanyaa retrieved a tightly folded bag from her gear and slipped the statue into it.\n\n​\n\n*SLAM!*\n\n​\n\nHeavy, iron-set doors were flung open as the baron's guards pushed past one another to enter the room. \n\n​\n\n\"Over here! The Shadow Society is here!\"\n\n​\n\nThat was the trouble with warning a mark ahead of time with your calling card... though, Sanyaa supposed, it also made things a lot more fun. Plus, she thoroughly enjoyed seeing her victims powerless to do anything about it. \n\n \n\nThese four guards started to surround her. They had no idea what was coming. \n\n \n\nThe thing about being a master thief is movement becomes effortless. Every motion is graceful, and no motion is wasted; part of Sanyaa's speed came from always doing at least two things at once. It was remarkable how little most people utilized their bodies.\n\n \n\nFor example, her first pirouette allowed her to dodge one guard's sword, kick another in the face, and slam the third on the back of his head with the butt of her knife. That was Sanyaa's first dance step, and she was only getting started. There was plenty of song to go.\n\n \n\nThe remaining guards were left tripping over or into themselves, stumbling on the bodies of their unconscious brethren. Their attacks became even easier for Sanyaa to dodge, and she seemed to be picking up an excited momentum the more fury she unleashed.  \n\n \n\nOne by one, the baron's men fell, until Sanyaa heard the clamor of another group of guards headed her way. It was smarter to play it safe. She kept her blades sharp and ready, but murder was often bad for business. An elbow or knee, delivered with force and at the proper angle, could knock out a man for a good long while. Sanyaa leaped off the final guard before more could arrive, flipping herself up onto a hanging chandelier. The moonlight caused its crystals to sway and sparkle until Sanyaa finally came to a stop.\n\n \n\nShe grinned. Lightly stepping from beam to beam, she found her exit in a small, high window, scaling down the outer wall. By the time reinforcements arrived, there was no trace of the thief. Though any guard there could tell you that the absence itself felt mocking. \n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1380/img_story_sanyaa_02.jpg[/img]\n\n \n\n-\n\n \n\nThe sunrise found Sanyaa back at Ellyllon Manor, headed to the study with a spring in her step. She made her way to the study Hejmdal constantly worked in. It was equal parts cozy and commanding, the antique cabinets filled with books on all manner of subjects worthy of robbing. Right now her father was probably working in his overstuffed chair, avoiding the direct sunlight the morning always flooded the window with. \n\n \n\nYet as she neared the locked door she heard a clash of raised voices. He was arguing with someone, and Sanyaa had a good idea who.\n\n​\n\n\"I will not stand idly by and let you get away with this, Hejmdal.\"\n\n​\n\nSigal, the guildmaster's second-in-command, was in charge of the Shadow Society's day-to-day operations. He handled the more mundane tasks while Hejmdal focused on the big picture. Sanyaa could imagine what Sigal's face must look like right now. He was probably attempting to look intimidating, but the effect would be ruined by a flush to his cheeks and sweat cascading off his brow.\n\n​\n\n\"Get away with doing our duty, you mean? Sigal, do you mean to go against my direct orders?\"\n\n​\n\nHejmdal's calm belied his threatening demeanor. Everything about him was exuding menace. His sharp eyes bore through Sigal as if seeing all his scheming and striking every internal organ. \n\n \n\n\"Then why the hell are we saying no to this?\" he stammered up at the much larger man. \"I'm talking about good money, Hejmdal, and I've already spent some just to get things to this point. It's not like any of us will get hurt.\"\n\n \n\n\"No, but others could,\" he cautioned. \"I've tried to teach you that money isn't everything, Sigal. Remember who we are.\"\n\n​\n\nHis second-in-command scowled. The scar snaking across his face twisted and writhed like the genuine article, and with no less the venom for it. As he felt his face get hot and his sweating threatened to soak his shirt, though, he grudgingly sighed.\n\n​\n\n\"We... are the Shadow Society.\"\n\n \n\n\"That's it. [u]The[/u] Shadow Society. Our code gives us no small measure of security from those in power who appreciate our stance, and the service we provide. If we stoop so low as to act like common bandits and ruffians, as you suggest, then who's going to support us?\"\n\n \n\n\"But—!\"\n\n​\n\nSigal tried to rally again, but having lost steam he didn't stand a chance by this point. Hejmdal stopped him with a one raised his hand, his mind made up. The gesture was not unkind, but it was firm. Absolute. \n\n​\n\n\"I've said my piece. Now if you don't mind, Sanyaa is supposed to arrive at any moment.\"\n\n \n\nIn the face of Hejmdal's respectful response, Sigal wasn't able to think of an approach that wasn't an attack. He shuffled awkwardly from foot to foot before storming out in a hurry, perhaps fearful that the conversation would start again.\n\n \n\nAs he slammed the door open in frustration, he almost crashed into Sanyaa, still waiting and listening to everything. \n\n​\n\n\"Of course! Eavesdropping like some common alley cat?\"\n\n​\n\nSigal redirected his ire towards the girl... or, tried to. \n\n​\n\n\"I never need to eavesdrop on you. Your voice carries for miles.\"\n\n​\n\nSanyaa's chilly reception had even more bite than usual. Calling a thief loud was almost worse than going after their mother. She may have been adopted, but her eyes were just as sharp as Hejmdal's, and seemed to look through and past the second-in-command. Sigal frowned, his scar practically twitching.\n\n​\n\n\"Hmph...\"\n\n​\n\nHe tried to push her aside roughly, if just to feel a bit better about himself, but she sidestepped so effortlessly that he only accomplished an embarrassing half-stumble. Sanyaa decided not to follow it up with a comment... whatever dozens of possibilities he was imagining would be more of a torment than sticking to one that she'd actually uttered.\n\n \n\nAs Sigal skulked down a dark corridor, Sanyaa finally entered the manor's study. \n\n \n\nShe felt like she could practically carve through the tension hanging in the air with one of her knives, but Hejmdal smiled as is nothing was wrong. \n\n​\n\n\"I'm here, Hejmdal. Ugh... there's your old man smell, again.\" Sanyaa pretended to hold her nose as she complained, but Hejmdal just looked at her with fondly. This wasn't a new greeting for her. \"I thought I'd grow old and infirm out there. What could you two have possibly been talking about for so long?\"\n\n​\n\nHejmdal chuckled as she took a seat across from his desk.\n\n​\n\n\"Nothing new. Butting heads. I wish Sigal focused less on his business proposals and more on what we really aim to accomplish.\"\n\n \n\n\"I don't get why a guy like that's even in the Shadow Society.\"\n\n​\n\nHejmdal was quite familiar with his daughter's distaste for his second-in-command.\n\n​\n\n\"He's part of the family, Sanyaa. I'm sure he'll come around. I was actually hoping to speak with you about something that happened last night.\" He took a sheaf of paperwork from a side table as he sat down opposite her. \n\n​\n\n\"You're being awfully coy for someone who already knows exactly what happened.\" Sanyaa's grin was infectious, but also somewhat rare. She rarely allowed herself a genuine moment like she could with him. She was clearly proud of the heist, and clearly thought that she'd made Hejmdal proud.\n\n​\n\n\"It's a hell of a statue. 'The Goddess with the Sword' was definitely the best prize there... I wasn't actually planning to steal it, though. Not in the traditional sense. I hoped to frame another thieves' guild. Take some heat off us.\"\n\n​\n\nHejmdal focused on the task of shuffling papers. When something was truly serious he'd look directly at Sanyaa, and he pointedly [u]wasn't[/u] doing that here.\n\n​\n\n\"Oh... Well, I was thinking that we could buy a lot more bread for the townsfolk. I mean... that [u]is[/u] what it means to be a member of the Shadow Society, isn't it?\" She looked hopefully at her adoptive father. He didn't frown, but he pondered for a long moment before he answered.\n\n​\n\n\"Sanyaa, did you know that Georg is the second son of Count Galoa?\"\n\n \n\n\"I didn't. Did he? That sounds like it'd come with more competent guards.\" Her smile began to drop as she tried to puzzle out Hejmdal's expression. He finally lifted his gaze to meet hers directly.\n\n​\n\n\"It's best we not provoke him. That family could make a lot of trouble for us.\"\n\n \n\n\"Oh, not this again,\" she muttered. \"You're so old-fashioned. Nothing I've heard makes it sound like they deserve to be in power, anyway.\"\n\n​\n\nShe responded with a pout, a half-cute half-serious maneuver she'd perfected over the years, but Hejmdal just kept looking at her with the same curious expression. She'd never seen him worried before and had no reference for it.\n\n​\n\n\"Sanyaa, I am your guardian. Your father entrusted me with your well-being. If you caught the attention of the Count, or his wrath...\" \n\n \n\nShe slumped in her chair, crossing her arms in agitation.\n\n \n\n\"I have a responsibility to keep you safe. I'm not sure your father would love that I ended up training you in stealth and sly cunning—that's the apple landing a little too near the tree, and I suspect part of the reason he sent you away was to prevent that—but I did it so you'd have the tools to protect yourself. To hide.\"\n\n​\n\n\"I can never hide looking like this, Dad.\"\n\n​\n\nHe sucked in his breath through clenched teeth; that was a nerve he hadn't meant to strike.\n\n​\n\nThe \"Dad\" was intentional, a point she always drove home whenever her birth father was mentioned.\n\n \n\nSanyaa also had a lifelong hatred of her albinism. She could have been seen as a miraculous birth if only people hadn't been so judgmental. Geongon, the fabled land of mist and fog, knew only hair black as a raven's wing. It had proven difficult for her to make friends when most were so judgmental. She received constant attention from the moment she was born, but it wasn't of a good kind, and her unique features made it seemingly impossible to interact with her people.\n\n \n\nThere was one particular children's story that affected her, about an ugly duckling that grew into a white swan, but the tale hadn't panned out for Sanyaa as well as it did for the bird. A deep loneliness remained, a hole in her heart.\n\n \n\nSo her father entrusted her care to his old friend Hejmdal, hoping that she'd find more acceptance in western lands where skin as fair. It didn't work here, either.\n\n \n\nThat caused her to grow callous and cold, which just kept fueling the cycle. That drive to prove herself to the world might have also made her the best thief he'd ever seen. But could her scarred heart ever heal? Hejmdal did not dare to ask that question, and didn't feel she'd give him a straight answer, anyway.\n\n​\n\n\"What is it? Are you thinking about how precious and darling I am? I get that a lot.\"\n\n \n\n\"It's nothing. More importantly, have you given any thought to my suggestion?\"\n\n​\n\n\"Oh.\" She'd been trying to avoid that topic. \"A trip back to the east... I don't know. I'm not feeling it, and I don't see the point. There's nothing for me there.\"\n\n​\n\nShe stared out the window with practiced indifference, but she couldn't stop herself from absentmindedly toying with the sheath at her side. Her shining silver hair glimmered in sunlight.\n\n​\n\n\"I wish you wouldn't think like that.\"\n\n \n\n\"You're my father. Not him. [u]He[/u] abandoned me.\" The words tore through clenched teeth with more force than she'd meant. \"It's not like I remember much, anyway. Ellyllon Manor is my home. The Shadow Society is my family. Look, just... I appreciate you thinking about me, but I belong here.\" She trailed off into sentimentality, but her words rang out with conviction.\n\n​\n\nThere wasn't much he could respond to that with. All Hejmdal could do was nod slowly, as much to himself as to her. He'd been hoping she might soften in time, but if anything she sounded more jaded than ever. It had been more than ten years since the girl had come to live here, so perhaps it was inevitable. \n\n​\n\n\"I do wonder, sometimes... Do you think I'll ever look like a Westerner to them? Or will it just be a repeat of my childhood?\" Sanyaa muttered, as she looking out the window and pointedly avoiding his gaze. She suspected what the truth was and she didn't want it verified.\n\n \n\nHejmdal responded carefully. \n\n​\n\n\"None of that matters. You're special, Sanyaa, but it has nothing to do with your looks or where you came from.\"\n\n \n\nShe clearly wasn't expecting that answer, but it seemed to do the trick. Her expression brightened as she relaxed back into the worn padding of the chair. \n\n \n\nThe two enjoyed a lazy day talking about the small things, like they always did.​ The rest of the world faded away for Sanyaa. She was grateful for the momentary peace, far from any stares. \n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1381/img_story_sanyaa_03.jpg[/img]\n\n \n\n-\n\n \n\nIt was another brisk night, several days later, as she once again opened the secret door in her bedroom and geared up for a night of thievery and mischief-making. She wasn't trying to skirt around Hejmdal's wishes, but she couldn't just lounge around a manor estate while a village was starving. Her skills meant coin, and coin meant bread. Perhaps, one day when this famine had ended, she could—\n\n​\n\n*knock knock*\n\n​\n\nThere was a light knocking on her door. \n\n \n\nIt was the manor's maid, Elga. She was a Westerner around Sanyaa's age.\n\n​\n\n\"Miss Sanyaa, the guildmaster is looking for you.\"\n\n \n\n\"At this hour?\" she groaned, glancing quickly out the window. \"Did he mention why?\"\n\n \n\n\"I'm afraid not, Miss. Only that it's quite urgent.\"\n\n \n\n\"Huh... Thanks, Elga.\"\n\n​\n\nSanyaa nodded and headed towards Hejmdal's study, her steps quickening the closer she got. She was growing too concerned to notice the maid's chilling glare follow her down the hall. \n\n​\n\n\"...Go to hell, you filthy foreigner.\"\n\n \n\n-\n\n​\n\nSanyaa didn't bother knocking, having grown fearful of what this late-night summons might mean. Inside the study she found an oil lamp on the desk, dimly lighting the room, and Hejmdal pouring over paperwork.\n\n​\n\n\"Hmm?\" he looked up in mild surprise. \"My dear, what are you doing here at this hour? Is everything all right?\"\n\n​\n\nThe slight confusion on his face only added to her own.\n\n​\n\n\"Uh, yeah. Everything's just fine. I heard you were looking for me.\"\n\n \n\n\"Not me. Who told you that?\"\n\n \n\n\"Elga.\"\n\n​\n\nAfter a moment, Hejmdal's kind eyes began to narrow.\n\n​\n\n\"Elga... That new maid? The one that... Sigal hired?\"\n\n \n\n\"Yeah, she—\"\n\n​\n\nAll of the sudden, the relative silence was shattered. \n\n \n\nThe sounds of windows breaking and the weapons clashing, The window in the study, and from the sounds of it every one in the manor, were broken through. The shards were crunched beneath heavy boots, the type with a forceful stomp that was always a sign of heavy armor being worn. These thieves could pluck sounds from a din like they were coins from a purse, and everything was telling them that guards were fast approaching.\n\n​\n\n\"I can't believe this,\" Sanyaa growled. \"I should have seen it coming! Of course Sigal would set a trap for us. He's not talented enough to fight me one-on-one.\" \n\n​\n\nHejmdal seemed less positive of that than she.\n\n​\n\n\"I'm not so sure,\" he said with his usual thoughtfulness, despite the incoming danger. \"Sigal may be stubborn, and we have our differences, but he's not the type to take so readily to betrayal.\" Unlike Sanyaa, Hejmdal still seemed to trust Sigal.\n\n \n\nThere would be no further time for discussion, though. A horde of guards burst through the door to the study. \n\n​\n\n\"Hejmdal Ellyllon, you are under arrest!\"\n\n​\n\nSanyaa's unique eyes, blue but with red pupils, was a gift of her albinism, but seemed to embody rage incarnate in this moment. She held her tongue, though, and deferred to her surrogate father. \n\n \n\nHejmdal answered calmly, fully composed.\n\n​\n\n\"Quite the urgent matter in the dead of this cold night,\" he offered. \"Surely this misunderstanding could have waited till the morning. Is it a crime to hand out bread to the hungry?\"\n\n \n\n\"Stop feigning the charity act. We have it on good authority that you are the head of the notorious Shadow Society thieves' guild.\"\n\n​\n\nThe guard captain's loud words took a moment to settle around the study.\n\n \n\nFinally realizing how dire their situation was, Sanyaa tried formulating a plan. [u]Was fight better? Or flight?[/u] She was confident she could take down ten of these guards, and thirty if Hejmdal was by her side, but she could hear even more than that circling the manor.\n\n \n\nFor his part... Hejmdal laughed. A loud, boisterous sound that filled the room with warmth.\n\n​\n\n\"Me? Hejmdal Ellyllon, secretly a master thief? I should think my doting daughter would have something to say about that. Unless, of course, you think her a thief, too? I appreciate you coming, gentlemen, because I sorely needed a laugh of late. Such shocking pronouncements do require evidence, though.\"\n\n\"You have the gall to demand evidence?\" the captain sputtered. \"Here, then. Let proof of your villainy satisfy you.\"\n\n​\n\nFrom the back, Count Galoa himself stepped forward. In his hand was a familiar looking black bag. In his hand was a familiar black bag. One that Sanyaa usually kept tightly folded among her burglary kit. She didn't have enough time to process how he would even have her bag before he opened it.\n\n \n\nWithin was the statue Sanyaa stole, 'Goddess with the Sword.' Its smooth surface gleamed in the light of the oil lamp, leaving no doubt as to its authenticity. \n\n​\n\n\"Now if you don't mind explaining, how exactly is this prized treasure in your possession, when all know it to be stolen by the Shadow Society?\"\n\n​\n\nHejmdal did his best to mask his emotions, but Sanyaa could see his shoulders slump at the sight. The evidence was damning.\n\n \n\nShe was just as shocked. \n\n​\n\n[u]It's me,[/u] she thought. [u]All of this is happening because of me.[/u]\n\n​\n\nIt was difficult to believe that the scene before her all stemmed from her actions. It didn't make any sense that this could be happening. The bag hadn't even been with the statue any longer, having already been returned to her kit... though raising a stray hand to one strap, she could feel that it was indeed missing. [u]This is a trap,[/u] was the only notion she could cling onto. [u]This is a setup.[/u] ​It was like a nightmare.\n\n​\n\n\"Raise your hands above your head and surrender now, Hejmdal. This is your only warning.\" The guard captain was met with silence.\n\n​\n\nHejmdal and Sanyaa slowly stepped back from the approaching soldiers, though it was not out of fear. They needed a little space to build up their speed and momentum.\n\n \n\nThe scrape of steel echoed through the study as weapons were drawn and heavily armored boots marched forward. The glint of spears and swords drew crescent moons in the dimly lit room, creating momentary curves in the air. It would have been beautiful if the situation wasn't so deadly.\n\n \n\nFather and daughter moved like they were performers, dodging and parrying the incoming onslaught with seeming ease. It never did any good to let your foes see you nervous, and an intimidating display of prowess might well scare some of them off if you didn't give up the game.\n\n \n\nSanyaa swirled, ripping off the window curtains to strangle the first guard to come her way. He served as a human shield as she batted several others back. She kicked a chair into the knees of the second, shattered it over the head of the third, and caught one splintered leg just in time to drive it into a fourth guard's shoulder. She finally let the suffocating guard drop to the floorboards when he'd had enough.\n\n \n\nIf anything Hejmdal was even more impressive. Nothing aids a thief as greatly as surprise, so to that end he lifted his desk with unrivaled strength and slammed his own assailants into the bookshelves. Unfortunately, one guard dropped a torch that soon lit up the cascade of books and parchment that rained down upon them. The rug was the next to catch flame, and soon the entire study was engulfed.\n\n \n\nThe melee continued as long as the flames would allow. Though the guards had the numbers, new members rushing in as soon as the previous ones fell, none were a match for the Shadow Society.\n\n \n\nThe family was trying to urge the lawmen to rescue their fallen, but they either couldn't hear the shouts over the sounds of battle, or they feared it was some sort of trick.\n\n \n\nFar in the back, though, still stood Count Galoa himself.\n\n \n\n\"There's only two of them! Bah, enough of this.\" He signaled for the archers to fire into the room.\n\n \n\nSanyaa couldn't believe it had come to this, but there was no way she could dodge that many arrows shot at that close distance. All she could do was close her eyes. \n\n \n\nYet she felt nothing. There was no pain. \n\n​\n\n\"...Am I dead? Hejmdal…?\"\n\n​\n\nShe opened her eyes to find Hejmdal's bulky form standing between her and the guards. He was pierced by countless arrows, like some target at the range. \n\n​\n\n\"Dad!\"\n\n \n\n\"I'm... all right...,” he managed. “Sanyaa, you've g-got to get out of h-here.\" Hejmdal looked directly into her eyes. He was tearing up. \n\n​\n\n\"I'm not going to leave you, like some coward!\"\n\n \n\n\"I'll be right b-behind you. Now, hurry...!\"\n\n​\n\nSanyaa leaped onto the room's only windowsill, it's glass long shattered. She turned to see his back, large enough to block her view of the rest of the study or the guards that filled it. Something about this felt off to her. He said that he'd come, but she couldn't help but think that this was the last time she might see him.\n\n​\n\n\"You'd better follow right behind...\"\n\n​\n\nHe sighed in relief, standing his full height as she stepped into a darkness as all-consuming as the ocean and as silent as the grave. His eyes were filled with determination. He would protect Sanyaa until his very end.\n\n​\n\n\"I'm so sorry, my girl. I wish I could have done m-more to protect you. You must live on... Y-you don't know about your birth...\"\n\n​\n\nSummoning the last of his strength, Hejmdal grabbed as many guards as he could and thrashed around the room, slamming them into anything nearby and trying to buy Sanyaa enough time. He really had grown to think of her as his own daughter. Years ago, now. He thought about her birth father, his old friend Shinma, but he wasn't sure if he'd be proud or disappointed in him here at the end. \n\n \n\nWave after wave of fresh guards rushed towards him.\n\n \n\nAs the fire in the hearth was finally snuffed out at dawn, so was Hejmdal.\n\n \n\n[img]https://nxcache.nexon.net/cms/2024/q3/1382/img_story_sanyaa_04.jpg[/img","[SALES] Milky Crystal":"https://vindictus.nexon.net/game/prob]Probability Rates[/url]\n\n\n[url=https://vindictus.nexon.net/news/93103/milky-crystal]Click HERE for More Details![/url]\n\n[img","[SALES] Oasis Packages":"https://vindictus.nexon.net/news/93442/oasis-packages]Click HERE for the Sales Details[/url"}}