{"last_cache":"2024-03-21T12:04:51.251Z","Dragalia":{"Content Update: 06/24/2022 - Chapter 26 Part One":"https://gamepress.gg/node/70706","Content Update: 04/25/2022 - Chapter 25 Part One":"https://gamepress.gg/node/68386","Content Update: 03/31/2022 - Gala Dragalia (March 2022) - Bondforged Prince & Bondforged Zethia":"https://gamepress.gg/node/67611","Content Update: 03/27/2022 - 3.5 Anniversary, Gala Dragalia (March 2022) - Gala Nedrick & Primal Brunhilda + Advent of the Origin datamine, welfare Origa":"https://gamepress.gg/node/67471","Content Update: 03/14/2022 - Gala Dragalia Remix (March 2022) - Sheila":"https://gamepress.gg/node/67036"},"KoL":{"March 06":"https://www.kingdomofloathing.com/","February 29":"https://www.kingdomofloathing.com/","February 14":"https://www.kingdomofloathing.com/","December 26":"https://www.kingdomofloathing.com/"},"Lost Ark":{"2024 New Year Celebration":"https://www.playlostark.com/en-us/news/articles/new-year-celebration-2024?tag=events","Lost Ark Anniversary Art Contest":"https://www.playlostark.com/en-us/news/articles/2nd-anniversary-art-contest?tag=events","Maykoko Fest Emote Design Competition":"https://www.playlostark.com/en-us/news/articles/maykoko-emote-design-competition?tag=events","Announcing Maykoko Fest":"https://www.playlostark.com/en-us/news/articles/maykoko-fest-explainer?tag=events","Pixel Glasses & Growth Twitch Drop":"https://www.playlostark.com/en-us/news/articles/twitch-drop-march-2023?tag=events","New Prime Gaming Loot - Magick Society Special Dye Chest":"https://www.playlostark.com/en-us/news/articles/prime-gaming-loot-march-2023?tag=events","Anniversary Celebration":"https://www.playlostark.com/en-us/news/articles/first-anniversary-celebration?tag=events","January Update Announcement":"https://www.playlostark.com/en-us/news/articles/january-2023-update-announce?tag=events","Lost Ark x The Witcher Announcement":"https://www.playlostark.com/en-us/news/articles/lost-ark-x-the-witcher?tag=events"},"Mabinogi":{"16th Anniversary Festival of Stars Event":"https://wiki.mabinogiworld.com//view/16th_Anniversary_Festival_of_Stars_Event","Glenn Bearna Support":"https://wiki.mabinogiworld.com//view/Glenn_Bearna_Dungeon_Support"},"Maplestory":{"[Updated 3/19] v.249 - Minar Picnic Patch Notes":"https://maplestory.nexon.net//news/90462/updated-3-19-v-249-minar-picnic-patch-notes","The Marvel Machine Returns March 22!":"https://maplestory.nexon.net//news/90352/the-marvel-machine-returns-march-22","Gold Richie's Safe":"https://maplestory.nexon.net//news/90138/gold-richie-s-safe","Miracle Winter - February 3 - Hats":"https://maplestory.nexon.net//news/89135/miracle-winter-february-3-hats","Miracle Winter - January 27 - Gloves":"https://maplestory.nexon.net//news/88963/miracle-winter-january-27-gloves","Miracle Winter - January 20 - Accessories/Emblems/Hearts/Rings":"https://maplestory.nexon.net//news/88818/miracle-winter-january-20-accessories-emblems-hearts-rings","More Identisk Events to Enjoy!":"https://maplestory.nexon.net//news/88828/more-identisk-events-to-enjoy","Miracle Winter - January 13 - Shoes":"https://maplestory.nexon.net//news/88712/miracle-winter-january-13-shoes"},"OSRS":{"Varlamore: Part One":"https://secure.runescape.com/m=news/varlamore-part-one?oldschool=1","Poll #81: Mage Training Arena":"https://secure.runescape.com/m=news/poll-81-mage-training-arena-?oldschool=1","God Alignment Prayers - Consultation & Direction":"https://secure.runescape.com/m=news/god-alignment-prayers---consultation--direction?oldschool=1","Project Rebalance Part One - Skilling":"https://secure.runescape.com/m=news/project-rebalance-part-one---skilling?oldschool=1","Miscellaneous Quality of Life Changes":"https://secure.runescape.com/m=news/miscellaneous-quality-of-life-changes?oldschool=1"},"Path of Exile":{"Path of Exile: Necropolis Teasers":"https://www.pathofexile.com/forum/view-thread/3495541","Ancestor Supporter Packs and Kirac's Vault Pass End Soon":"https://www.pathofexile.com/forum/view-thread/3496577","GGG Live Twitch Drops":"https://www.pathofexile.com/forum/view-thread/3496341","Weekend Skill Effects Sale":"https://www.pathofexile.com/forum/view-thread/3495991","Play Path of Exile 2 at PAX East":"https://www.pathofexile.com/forum/view-thread/3495966"},"Tarkov":{},"Vindictus":{"\"Special Stern Patrician Top\" Dye Part Change Pre-Notice":" dye parts of the Special Stern Patrician Top will be changed during the Tuesday maintenance on 3/26/2024.\n[list]\n[*] The coat lining's color that was influenced by 'Color Part 3' will be changed to be affected by 'Color Part 2' instead.\n[*] Due to this change, the Special Stern Patrician Top's Color Parts 2 and 3 will revert to outfit's default dye colors.\n[/list]\n\nIf you had used an Outfit Dye Ampoule to apply different colors to Color Parts 2 and/or 3 before the maintenance, we will send an appropriate Experimental Outfit Dye Ampoule to your character's mailbox.\n[list]\n[*] [i]Example 1[/i]: If you have colors applied to both Color Parts 2 and 3 that differ from the default colors, you will receive ampoules for each part.\n[*] [i]Example 2[/i]: If you have a color that is different than the default color applied to Color Part 2, but not to Color Part 3, then you will only receive an ampoule for Color Part 2.\n[/list","[CMTY] [Letter from Allanon] Expertise Update (Intention and Changes)":"Hello, This is DEV Allanon.[/h3]\n\nThe Vindictus Team has received extensive feedback from our users regarding the Max Level Expansion and Expertise Update.\n\nThoroughly reviewing the feedback provided an opportunity to assess whether the planned update is on the right track.\n\nBefore delving into the details, it's necessary to explain the intention behind the Expertise update.\n\nAdditionally, I would like to address the changes we’ve made based on the feedback from our users.\n\n\n[h3][INTENTION FOR EXPERTISE UPDATE][/h3]\n\nThe intention for the expertise update can be elaborated in three main aspects:\n\n[b]1. We aim to make the circulation of materials more fluent by expanding the usage of expertise and farming processes.[/b]\n\nAs valuable materials are concentrated in top-tier battles, we intend to adjust the value of lower-tier battles through the update.\n\nWe expect to create a more enriching gaming environment by providing motivation to users enjoying top-tier battles and inducing play patterns such as targeting specific battles for needed items.\n\nWe're also considering developing a feature that allows players to selectively remove the crafter's name, as previously discussed.\n\n\n[b]2. We are planning to gradually change the gameplay pattern to reduce play fatigue and require less playtime.[/b]\nIn line with recent gaming trends, we want our users to enjoy Vindictus with a lighter heart than before.\n\nTo achieve this, we plan to change and adjust the playtime structure more efficiently, resulting in better outcomes.\n\nWe anticipate that the ‘Core Boost System’ will lead the intended changes, with increased synergy expected from this system in line with the first intention mentioned.\n\nAdditionally, for players who prefer longer playtimes, we felt it necessary to adjust the advantages of playing sub-characters.\n\n\n[b]3. With the diminishing importance of communication, we intend to activate more interaction between users through Expertise.[/b]\n\nAs an online game, playing with others is unavoidable.\n\nHowever, due to recent declines in competition and cooperation, there is a concern that interacting with one another may seem awkward in Vindictus.\n\nWhile the expertise update may not be the perfect solution, we hope it will serve as a stepping stone for positive change.\n\n\n[b][MODIFICATION FOR PLANNED EXPERTISE UPDATE][/b]\n\n[b]Firstly, top-tier expertise will remain shareable across accounts.[/b]\n\nCrafting will also be possible with shared top-tier expertise.\n\nThis means a single character will be able to use all top-tier expertise and engrave the same crafter's name on items.\n\nAlso we are planning to develop an function to delete the crafter name as well.\n\n[b]Secondly, material refinement needed for crafting will be possible through both expertise crafting and NPC crafting.[/b]\n\n\n[b]Thirdly, we plan to introduce an expertise transfer system for players currently investing time and effort into upgrading expertise proficiency.[/b]\n\nTransfer between characters meeting certain requirements such as level will be possible.\n\nDuring the transfer, the title related to the expertise will also be transferred.\n\nHowever, top-tier expertise will not be transferable, and only expertise proficiency up to 399 will be eligible for transfer.\n\n\n[b]In summary,[/b","[COMMUNITY] DevTalk Afterwords":"o. This is DEV Allanon, the Director of Vindictus. \n\nFirst, I'd like to apologize for the late Dev Talk. \nI've promised earlier that it'll be revealed by the end of the month.  \n\nIn fact, it was originally planned to be disclosed on the 23rd.\n\nBut due to unexpected internal reasons, we had to delay the release by a week. \nIf further explanation is needed like this time, I will endeavor to expand our communication channels as much as possible. \n \nIn response to feedback from many of our players who felt burdened by the Expertise Proficiency, I've decided to double the Proficiency and Crafting Speed until the Max Level Update. \n \nAdditionally, to build anticipation for the new female character, I dropped a hint during the Dev Talk. \nAnother clue: she is related to a specific character. \n \nAlthough it was unintentional, I inadvertently spoiled a recently updated storyline.\nI will take greater care to prevent such situations from occurring in the future. \n\n[b]Here are some of the inquiries we've received in a Q&A format. [/b]\n\n[b]Q: [/b]Would LV.120 equipment only be craftable through Expertise? \n[quote]A: Yes, LV.120 equipment is planned to be exclusively crafted through Expertise.  \nThis includes weapons, armor, totems, and accessories.  \nTo avoid any confusion, there will be no changes in the equipment available for crafting through each Expertise. [/quote]\n\n[b]Q:[/b] Is maximizing Expertise Proficiency mandatory? \n[quote]A: No, it is not mandatory to have maximum Expertise Proficiency to obtain LV.120 equipment.  \nAlternatively, you can request assistance from other players with the required Expertise level to craft the equipment for you.  \n\nYou may also use binded materials and items when requesting the craft from others. [/quote]\n\n[b]Q: [/b]When crafting LV.120 equipment, will Power Infusion and Quality be transferred? \n[quote]A: We do not plan to transfer Power Infusion and Quality when crafting LV.120 equipment.  \nHowever, enchants will be transferred when using the Extraction Rune during the crafting process. [/quote]\n\n[b]Q:[/b] Will LV.120 Armor be updated in the order of [Head – Chest – Leg – Hand – Foot]? \n[quote] A: The plan for updating LV120 equipment is as follows: \n[table]\t\t\t[tr]\t\t\t[td]\t\t\t\nWeapon (Beginner) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nHead (Beginner~Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nTotem \n\t\t\t[/td]\t\t[/tr]\t\t[tr]\t\t\t[td]\t\t\t\nWeapon (Fine) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nLeg (Beginner~Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nEarring \n\t\t\t[/td]\t\t[/tr]\t\t[tr]\t\t\t[td]\t\t\t\nWeapon (Superior) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nChest (Beginner~Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nBelt \n\t\t\t[/td]\t\t[/tr]\t\t[tr]\t\t\t[td]\t\t\t\nWeapon (Rare) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nHand (Beginner~Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nRing1 \n\t\t\t[/td]\t\t[/tr]\t\t[tr]\t\t\t[td]\t\t\t\nWeapon (Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nFoot (Beginner~Legend) \n\t\t\t[/td]\t\t\t[td]\t\t\t\nRing2 \n\t\t\t[/td]\t\t[/tr]\t[/table]\n[/quote]\n[b]Q: [/b]Will LV.120 equipment require no enhancement? Does this mean Superior Enhancement Elixir, Enhancement Rune, and Premium Enhancement Rune will no longer be needed? \n[quote]A: Even after reaching LV120, our plan is to retain the necessity of these items when upgrading the item tier. [/quote]\n\n[b]Q: [/b]Will there be a success rate for the LV.120 equipment upgrade? \n[quote]A: We intend to remove any possibility aspects from the upgrade process.  \nPlayers will only need the required materials for the upgrade.We'll monitor closely to determine if further explanation is necessary. [/quote","[COMMUNITY] DevTalk - 7th Episode":" Mercenaries,\n\nDevTalk the 7th Episode is here!\nOur Dev Allanon will introcude what is being planned for Vindictus.\nDon't miss what he has to say!\n[previewyoutube=PWNMTbPWDtI;full][/previewyoutube]\n\nWe also have prepared a gift at the end of the DevTalk.\nPlease watch it through and don’t miss it!\n[list]\n[*","Message from the Dev Team Regarding a New Game Using the Vindictus IP":"o. This is DEV Allanon, the Director of Vindictus.\n\nI would like to deliver the official statement from the dev team to our players following the announcement that Nexon's newly developed game using the Vindictus IP, \"Vindictus: Defying Fate,\" will be entering a pre-alpha test on Steam.\n\n\"Vindictus: Defying Fate\" is a brand-new game that is being developed.\n\nDue to its use of the Vindictus IP, the game will contain familiar characters, NPCs, region names, monsters, and certain outfits.\n\nHowever, \"Vindictus: Defying Fate\" is being developed as a single-player focused game, aiming to be released on console and PC platforms, which moves it in a very different direction from the original Vindictus.\n\nSince their gameplay differs this will have no impact on the service of Vindictus during the development of \"Vindictus: Defying Fate,\" both now and in the future when it is released.\n\nVindictus is still planning to provide content for both short and long-term play, starting with our upcoming progression structure improvements in April and soon followed by our max level expansion this May.\n\nWe will continue to actively deliver our updates and our talks with you, like we have been doing, and as ever we'll do our best to include what you players want to see.\n\nWe anticipate that \"Vindictus: Defying Fate\" will be an opportunity to spread the IP even further out while we continue to maintain Vindictus as the original, and we will work hard to maintain the charm of the original Vindictus that we have built alongside our players.\n\nWe hope to get your continued support for our franchise.\n\nI would like to thank all of our Vindictus players, and I wish nothing but happiness and health for you all.\n\nThank you!\n\n[i"}}